In [2]:
import sys, os
print("Python:", sys.executable)
import pandas as pd
print("pandas:", pd.__version__)

# garantir que o notebook encontra o módulo 'src'
import os, sys
sys.path.append(os.path.abspath(".."))

Python: /Users/pedroazevedo/Documents/GitHub/BigDataFoundations/.venv-franco/bin/python
pandas: 2.3.3

In [3]:
from src.utils import get_athena_connection, read_sql_df
from src.config import DB_ATHENA

conn = get_athena_connection()

# mostra as tabelas do Athena
sql = f"SHOW TABLES IN {DB_ATHENA};"
tables = read_sql_df(sql, conn)
tables

ModuleNotFoundError: No module named 'dotenv'

          tab_name
0           movies
1   movies_parquet
2          ratings
3  ratings_parquet
4            users
5    users_parquet

In [9]:
##teste

df_test = read_sql_df("SELECT * FROM movielens1m.movies_parquet LIMIT 5;", conn)
df_test.head()

c:\Users\sarac\rep_DSF\BigDataFoundations\src\utils.py:19: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(sql, conn)

   movieid                               title                        genres
0        1                    Toy Story (1995)   Animation|Children's|Comedy
1        2                      Jumanji (1995)  Adventure|Children's|Fantasy
2        3             Grumpier Old Men (1995)                Comedy|Romance
3        4            Waiting to Exhale (1995)                  Comedy|Drama
4        5  Father of the Bride Part II (1995)                        Comedy

In [8]:
df_test = read_sql_df("SELECT * FROM movielens1m.ratings_parquet LIMIT 5;", conn)
df_test.head()

c:\Users\sarac\rep_DSF\BigDataFoundations\src\utils.py:19: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(sql, conn)

   user_id  movie_id  rating           rating_ts
0        1      1193     5.0 2000-12-31 22:12:40
1        1       661     3.0 2000-12-31 22:35:09
2        1       914     3.0 2000-12-31 22:32:48
3        1      3408     4.0 2000-12-31 22:04:35
4        1      2355     5.0 2001-01-06 23:38:11

In [7]:
df_test = read_sql_df("SELECT * FROM movielens1m.users_parquet LIMIT 5;", conn)
df_test.head()

c:\Users\sarac\rep_DSF\BigDataFoundations\src\utils.py:19: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(sql, conn)

   user_id gender  age  occupation zipcode
0        1      F    1          10   48067
1        4      M   45           7   02460
2        5      M   25          20   55455
3        2      M   56          16   70072
4        3      M   25          15   55117